#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_СведенияОбОтпусках.Записывать = Истина;

	ТаблицаОтпусков = ОтпускаСотрудников.Выгрузить(,"Сотрудник, ПродолжительностьОтпуска");
	ТаблицаОтпусков.Свернуть("Сотрудник","ПродолжительностьОтпуска");

	Для Каждого Строка Из ТаблицаОтпусков Цикл
		
		Движение = Движения.ВКМ_СведенияОбОтпусках.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Год = Год;
		Движение.ПлановаяПродолжительностьОтпуска = Строка.ПродолжительностьОтпуска;
		
	КонецЦикла;
	
	Движения.ВКМ_СведенияОбОтпусках.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли