#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_СведенияОбОтпусках.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_СведенияОбОтпусках.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Год = Год;
		Движение.ПлановаяПродолжительностьОтпуска = (Строка.ДатаНачала - Строка.ДатаОкончания) / 864000;
		
	КонецЦикла;
	
	Движения.ВКМ_СведенияОбОтпусках.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли