#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;

	ТаблицаОтпусков = ОтпускаСотрудников.Выгрузить(,"Сотрудник, ПродолжительностьОтпуска");
	ТаблицаОтпусков.Свернуть("Сотрудник","ПродолжительностьОтпуска");

	Для Каждого Строка Из ТаблицаОтпусков Цикл

		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();

		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Год = Год;
		Движение.ДнейОтпуска = Строка.ПродолжительностьОтпуска;

	КонецЦикла;

	Движения.ВКМ_ПлановыеОтпуска.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли