#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	ОткрытьФорму("Документ.ВКМ_ГрафикиОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Отпуска.НомерСтроки КАК НомерСтроки,
		|	Отпуска.Сотрудник КАК Сотрудник,
		|	РАЗНОСТЬДАТ(Отпуска.ДатаНачала, Отпуска.ДатаОкончания, ДЕНЬ) + 1 КАК Продолжительность
		|ПОМЕСТИТЬ ВТ_Отпуска
		|ИЗ
		|	&Отпуска КАК Отпуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Отпуска.НомерСтроки КАК НомерСтроки,
		|	СУММА(ВТ_Отпуска.Продолжительность) ПО Сотруднику КАК Продолжительность
		|ИЗ
		|	ВТ_Отпуска КАК ВТ_Отпуска
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Отпуска.НомерСтроки";

	Запрос.УстановитьПараметр("Отпуска", Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания"));

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Объект.ОтпускаСотрудников[Выборка.НомерСтроки - 1].ПродолжительностьОтпуска = Выборка.Продолжительность;
	КонецЦикла;

КонецПроцедуры
&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
КонецФункции

#КонецОбласти