#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)	
	РассчитатьПродолжительностьОтпускаИОбновитьПодсветкуОтпусков(); 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	ОткрытьФорму("Документ.ВКМ_ГрафикиОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьПродолжительностьОтпускаИОбновитьПодсветкуОтпусков()
		
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			И ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			
			Если СтрокаОтпуска.ДатаОкончания >= СтрокаОтпуска.ДатаНачала Тогда
				СтрокаОтпуска.ПродолжительностьОтпуска = (СтрокаОтпуска.ДатаОкончания - СтрокаОтпуска.ДатаНачала)/86400 + 1;
			Иначе
				СтрокаОтпуска.ПродолжительностьОтпуска = 0;
			КонецЕсли;
			
		Иначе
			СтрокаОтпуска.ПродолжительностьОтпуска = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ПродолжительностьОтпуска");
	ТаблицаОтпусков.Свернуть("Сотрудник","ПродолжительностьОтпуска");
	
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		
		СтрокаСотрудника = ТаблицаОтпусков.Найти(СтрокаОтпуска.Сотрудник, "Сотрудник");
		Если СтрокаСотрудника = Неопределено тогда
			Продолжить;
		КонецЕсли;
		СтрокаОтпуска.ПревышенаДлительность = ?(СтрокаСотрудника.ПродолжительностьОтпуска > 28, Истина, Ложь);		
		
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()       
	
	ДанныеОтпусков = Новый Массив;

	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл

		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			
			Продолжить;
		КонецЕсли;

		ДанныеОтпуска = Новый Структура;
		ДанныеОтпуска.Вставить("Сотрудник", СтрокаОтпуска.Сотрудник.Наименование);
		ДанныеОтпуска.Вставить("ДатаНачала", СтрокаОтпуска.ДатаНачала);
		ДанныеОтпуска.Вставить("ДатаОкончания", СтрокаОтпуска.ДатаОкончания);

		ДанныеОтпусков.Добавить(ДанныеОтпуска);

	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОтпусков, Новый УникальныйИдентификатор);
КонецФункции

#КонецОбласти