#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДиаграммаГанта.Очистить();
	
	АдресВременногоХранилища = Параметры.Адрес;
	
	Если Не ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось получить данные для построения диаграммы.");
		Возврат;
	КонецЕсли;

	ГрафикОтпусков = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);

	СерияОтпуска = ДиаграммаГанта.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуск";
	
	Для Каждого Строка Из ГрафикОтпусков Цикл

		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, СерияОтпуска);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;  
	
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);

КонецПроцедуры

#КонецОбласти