#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДиаграммаГанта.Очистить();

	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось получить данные для построения диаграммы.");
		Возврат;
	КонецЕсли;

	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Текст = "Отпуска";

	Для Каждого Строка Из ГрафикОтпусков Цикл

		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти