#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВКМ_ВыполненныеКлиентуРаботы
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	
	ВКМ_ПроверитьДоговор(Отказ);
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
	
	СтавкаЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботы");
	ЧасыКОплате = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
    Движение.Период = Дата;
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.ВКМ_Клиент = ВКМ_Клиент;
    Движение.ВКМ_Договор = ВКМ_Договор;
    Движение.ВКМ_КоличествоЧасов = ЧасыКОплате;
    Движение.ВКМ_СуммаКОплате = ЧасыКОплате * СтавкаЧаса;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ПроверитьДоговор(Отказ)
    
   Если Не ЗначениеЗаполнено(ВКМ_Договор) Тогда
	   	ОбщегоНазначения.СообщитьПользователю("Не указан договор.",, "ВКМ_Договор", "Объект.ВКМ_Договор");
	   	Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЗначВКМ_Договор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор, "ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания");
	
	Если ЗначВКМ_Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	    ОбщегоНазначения.СообщитьПользователю("Вид договора не соответсвует, необходимо выбрать договор абонентского обслуживания.",, "ВКМ_Договор", "Объект.ВКМ_Договор");
	    Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Дата < ЗначВКМ_Договор.ВКМ_ДатаНачала Или Дата > ЗначВКМ_Договор.ВКМ_ДатаОкончания Тогда
	   	ОбщегоНазначения.СообщитьПользователю("Дата документа не входит в период действия договора.",, "Дата", "Объект.Дата");
	    Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли

