
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#Область ВКМ_Печать

// Устанавливает настройки печати для объекта.
//
// Параметры:
//  НастройкиОбъекта - Структура - настройки объекта метаданных, в которых
//                                  определяются параметры печати.
//
// Описание:
//  Процедура предназначена для управления видимостью команд печати в интерфейсе
//  объекта. Устанавливает флаг, определяющий, будут ли добавляться команды
//  печати в контекстное меню и панель инструментов объекта.
//
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	// Включаем добавление команд печати для текущего объекта
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Добавляет команды печати в интерфейс документа.
//
// Параметры:
//  КомандыПечати - тип -Коллекция команд печати, в которую добавляются новые команды.
//
// Описание:
//  Процедура предназначена для добавления доступных печатных форм в контекстное меню
//  и панель команд документа. Регистрируются все необходимые печатные формы,
//  связанные с текущим документом.
//
// Пример:
//  ДобавитьКомандыПечати(КомандыПечати);
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВКМ_АктОбОказанныхУслугах";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 5;
	
КонецПроцедуры

// Формирует печатные формы для переданных объектов документа.
//
// Параметры:
//  МассивОбъектов - тип - Массив - ссылки на документы, для которых необходимо
//                             сформировать печатные формы.
//  ПараметрыПечати - тип - Структура - дополнительные параметры печати (заполняется
//                                подсистемой печати, может быть пустым).
//  КоллекцияПечатныхФорм - тип - Коллекция - содержит доступные печатные формы,
//                                      каждая форма имеет уникальный идентификатор.
//  ОбъектыПечати - Структура - содержит объекты для заполнения макета
//                              (заполняется перед вызовом процедуры).
//  ПараметрыВывода - Структура - параметры вывода готового документа
//                                (например, количество копий).
//
// Описание:
//  Процедура обрабатывает коллекцию печатных форм, и для каждой доступной формы
//  вызывает соответствующую функцию формирования печатного документа.
//  Сгенерированный табличный документ помещается в коллекцию для дальнейшего
//  отображения пользователю или вывода на печать.
//
// Доступные печатные формы:
//     Макет: Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах
//
// Пример использования в подсистеме печати:
//   УправлениеПечатью.ВывестиНаПечать(Документы, ПараметрыПечати, "АктОбОказанныхУслугах");
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВКМ_АктОбОказанныхУслугах") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ВКМ_АктОбОказанныхУслугах", НСтр("ru='Акт об оказанных услугах'"), ВКМ_ОбщийМодульВызовСервера.ВКМ_ПечатьАктаОбОказанныхУслугах(МассивОбъектов),,
		"Документ.РеализацияТоваровУслуг.ВКМ_ПФ_MXL_АктОбОказанныхУслугах");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецЕсли