#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_СоздатьРеализацииПоАбонентскимДоговорам(ДатаНачала, ДатаОкончания) Экспорт
    
    ТаблицаДоговоров = ВКМ_ПолучитьДоговорыСРеализациями(ДатаНачала, ДатаОкончания);
    
    Результат = Новый Массив;
    Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
        
        СтруктураРезультата = Новый Структура;
        СтруктураРезультата.Вставить("Договор", СтрокаДоговора.Договор);
        СтруктураРезультата.Вставить("Реализация", Неопределено);
        
        Если ЗначениеЗаполнено(СтрокаДоговора.СуществующаяРеализация) Тогда
            СтруктураРезультата.Реализация = СтрокаДоговора.СуществующаяРеализация;
            Результат.Добавить(СтруктураРезультата);
            Продолжить;
        КонецЕсли;
        
        Попытка
            НоваяРеализация = ВКМ_СоздатьРеализациюПоДоговору(
                СтрокаДоговора.Организация,
                СтрокаДоговора.Договор,
                ДатаНачала);
            
            СтруктураРезультата.Реализация = НоваяРеализация.Ссылка;
            
        Исключение
            ЗаписьЖурналаРегистрации(
                "ВКМ_МассовоеСозданиеАктов",
                УровеньЖурналаРегистрации.Ошибка,
                ,
                "Не удалось создать реализацию по договору " + Строка(СтрокаДоговора.Договор),
                ИнформацияОбОшибке());
            
         КонецПопытки;
        
        Результат.Добавить(СтруктураРезультата);
        
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

Функция ВКМ_ПолучитьДоговорыСРеализациями(ДатаНачала, ДатаОкончания)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Договоры.Ссылка КАК Договор,
    |	Договоры.Владелец КАК Контрагент,
    |	Договоры.Организация КАК Организация,
    |	Реализации.Ссылка КАК СуществующаяРеализация
    |ИЗ
    |	Справочник.ДоговорыКонтрагентов КАК Договоры
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
    |		ПО Договоры.Ссылка = Реализации.Договор
    |		И Реализации.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |		И НЕ Реализации.ПометкаУдаления
    |ГДЕ
    |	Договоры.ВидДоговора = &ВидДоговора
    |	И Договоры.ВКМ_ДатаНачала <= &ДатаОкончания
    |	И Договоры.ВКМ_ДатаОкончания >= &ДатаНачала
    |	И НЕ Договоры.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

Функция ВКМ_СоздатьРеализациюПоДоговору(Организация, Договор, ДатаДокумента)
    
    НовыйЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	НовыйЗаказ.Дата = ДатаДокумента;
	НовыйЗаказ.Организация = Организация;
	//@skip-check bsl-legacy-check-string-literal
	НовыйЗаказ.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Владелец");
	НовыйЗаказ.Договор = Договор;
	НовыйЗаказ.Комментарий = "Создано обработкой ""Массовое создание актов"" от " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	ВКМ_ОбщийМодульВызовСервера.ВКМ_ВыполнитьАвтозаполнениеПоДоговору(НовыйЗаказ, Договор);
	НовыйЗаказ.СуммаДокумента = НовыйЗаказ.Услуги.Итог("Сумма");
	НовыйЗаказ.ПроверитьЗаполнение(); 
	НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение); 
        
    НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
    НоваяРеализация.Дата = ДатаДокумента;
    НоваяРеализация.Заполнить(НовыйЗаказ.Ссылка);
	НоваяРеализация.Комментарий = "Создано обработкой ""Массовое создание актов"" от " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
    НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение();
	НоваяРеализация.ПроверитьЗаполнение();
	НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
       
    Возврат НоваяРеализация;
    
КонецФункции

#КонецОбласти

#КонецЕсли