#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)

	Объект.Выплаты.Очистить();
	ЗаполнитьВедомостьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВедомостьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Взаиморасчеты.Сотрудник КАК Сотрудник,
		|	Взаиморасчеты.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаДокумента,) КАК Взаиморасчеты
		|ГДЕ
		|	Взаиморасчеты.СуммаОстаток > 0";

	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти