
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()

	Объект.ОсновныеНачисления.Очистить();
	Объект.ДополнительныеНачисления.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.Оклад, 0) КАК СуммаОклада,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.Сотрудник.ГрафикРабот, ЗНАЧЕНИЕ(Справочник.ВКМ_ГрафикиРаботы.ПустаяСсылка)) КАК ГрафикРаботы,
	|	&НачалоПериода КАК ДатаНачала,
	|	&КонецПериода КАК ДатаОкончания,
	|	&Оклад КАК ВидРасчета
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ) КАК ВКМ_УсловияОплатыСотрудников
	|ГДЕ
	|	НЕ ВКМ_УсловияОплатыСотрудников.Сотрудник.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплатеНачальныйОстаток + ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплатеОборот) КАК Сумма,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботы.ЧасовКОплатеНачальныйОстаток + ВКМ_ВыполненныеСотрудникомРаботы.ЧасовКОплатеОборот) КАК ЧасовКОплате,
	|	&НачалоПериода КАК ДатаНачала,
	|	&КонецПериода КАК ДатаОкончания,
	|	&ПремияПроцентом КАК ВидРасчета
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ВКМ_ВыполненныеСотрудникомРаботы
	|ГДЕ
	|	(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплатеНачальныйОстаток <> 0
	|			ИЛИ ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплатеОборот <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ПремияПроцентом", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом);

	Пакет = Запрос.ВыполнитьПакет();

	ВыборкаОсновные = Пакет[0].Выбрать();
	Пока ВыборкаОсновные.Следующий() Цикл
		СтрокаОсновного = Объект.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОсновного, ВыборкаОсновные);
	КонецЦикла;

	ВыборкаДополнительные = Пакет[1].Выбрать();
	Пока ВыборкаДополнительные.Следующий() Цикл
		СтрокаДополнительного = Объект.ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДополнительного, ВыборкаДополнительные);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти