
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()

	Объект.ОсновныеНачисления.Очистить();

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудников.Оклад КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВКМ_УсловияОплатыСотрудников.Сотрудник.ГрафикРабот КАК ГрафикРабот,
	|	&ВидРасчета КАК ВидРасчета,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Оклад <> 0) КАК ВКМ_УсловияОплатыСотрудников
	|ГДЕ
	|	НЕ ВКМ_УсловияОплатыСотрудников.Сотрудник.ПометкаУдаления";

	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		СтрокаНачисления = Объект.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНачисления, Выборка);
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти




