#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОсновныеНачисления.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены начисления.",,,,Отказ);
		Возврат;
	КонецЕсли;

	СформироватьОсновныеНачисления();
	СформироватьСторно();
	РассчитатьОклад();
	РассчитатьОтпускные();
	СформироватьПремиюПроцентом();
	СформироватьНДФЛ();
	РассчитатьНДФЛ();
	СформироватьВзаиморасчеты();
	СписатьВыполненныеРаботы(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьОсновныеНачисления()

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;

	Для Каждого Строка Из ОсновныеНачисления Цикл

		Если Строка.Сотрудник.Пустая() Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = Строка.ВидРасчета;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = Строка.ДатаОкончания;
		Движение.ГрафикРаботы = Строка.ГрафикРаботы;

		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ДатаНачала, -1));
		КонецЕсли;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();

КонецПроцедуры

Процедура СформироватьСторно()

	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();

	Если Не ЗначениеЗаполнено(СторноЗаписи) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Запись Из СторноЗаписи Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.Сторно = Истина;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();

КонецПроцедуры

Процедура РассчитатьОклад()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ДанныеГрафика.ЗначениеПериодДействия КАК Норма,
	|	ДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
	|	Основные.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(Условия.Оклад, 0) КАК Оклад
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Регистратор
	|			И ВидРасчета = &ВидРасчета) КАК ДанныеГрафика
	|		ПО Основные.НомерСтроки = ДанныеГрафика.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|			&Дата,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					ОсновныеНачисления.Сотрудник
	|				ИЗ
	|					РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
	|				ГДЕ
	|					ОсновныеНачисления.Регистратор = &Регистратор
	|					И ОсновныеНачисления.ВидРасчета = &ВидРасчета)) КАК Условия
	|		ПО Основные.Сотрудник = Условия.Сотрудник
	|ГДЕ
	|	Основные.Регистратор = &Регистратор
	|	И Основные.ВидРасчета = &ВидРасчета";

	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];

		Если Выборка.Норма <> 0 Тогда
			Движение.Результат = Выборка.Оклад * Выборка.Факт / Выборка.Норма;
		Иначе
			Движение.Результат = 0;
		КонецЕсли;

		Если Движение.Сторно Тогда
			Движение.Результат = -Движение.Результат;
		КонецЕсли;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);

КонецПроцедуры

Процедура РассчитатьОтпускные()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основные.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ОсновныеБаза.РезультатБаза, 0) КАК База,
	|	ЕСТЬNULL(ДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ДниОтпуска,
	|	ЕСТЬNULL(БазаГрафика.ЗначениеПериодДействия, 0) КАК РабочиеДниБазы
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	|			&Измерения, &Измерения, ,
	|			Регистратор = &Регистратор
	|			И ВидРасчета = &Отпуск) КАК ОсновныеБаза
	|		ПО Основные.НомерСтроки = ОсновныеБаза.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Регистратор
	|			И ВидРасчета = &Отпуск) КАК ДанныеГрафика
	|		ПО Основные.НомерСтроки = ДанныеГрафика.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Регистратор
	|			И ВидРасчета = &Оклад) КАК БазаГрафика
	|		ПО Основные.Сотрудник = БазаГрафика.Сотрудник
	|ГДЕ
	|	Основные.Регистратор = &Регистратор
	|	И Основные.ВидРасчета = &Отпуск";

	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");

	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];

		Если Выборка.РабочиеДниБазы <> 0 Тогда
			Движение.Результат = Выборка.База / Выборка.РабочиеДниБазы * Выборка.ДниОтпуска;
		Иначе
			Движение.Результат = 0;
		КонецЕсли;

		Если Движение.Сторно Тогда
			Движение.Результат = -Движение.Результат;
		КонецЕсли;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);

КонецПроцедуры

Процедура СформироватьПремиюПроцентом()

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основные.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(Работы.СуммаКОплатеОстаток, 0) КАК СуммаКОплате,
	|	Условия.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	|	ОсновныеНачисления.Сотрудник КАК Сотрудник
	|	|ИЗ
	|	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ОсновныеНачисления
	|	|ГДЕ
	|	|	ОсновныеНачисления.Ссылка = &Ссылка) КАК Основные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(
	|			&Момент,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					ОсновныеНачисления.Сотрудник
	|				ИЗ
	|					Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ОсновныеНачисления
	|				ГДЕ
	|					ОсновныеНачисления.Ссылка = &Ссылка)) КАК Работы
	|		ПО Основные.Сотрудник = Работы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|			&Дата,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					ОсновныеНачисления.Сотрудник
	|				ИЗ
	|					Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ОсновныеНачисления
	|				ГДЕ
	|					ОсновныеНачисления.Ссылка = &Ссылка)) КАК Условия
	|		ПО Основные.Сотрудник = Условия.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Момент", МоментВремени());

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Выборка.ПроцентОтРабот = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если Выборка.СуммаКОплате = 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом;
		Движение.Результат = Выборка.СуммаКОплате * Выборка.ПроцентОтРабот / 100;

	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();

КонецПроцедуры

Процедура СформироватьНДФЛ()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Основные.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК Основные
	|ГДЕ
	|	Основные.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Дополнительные.Сотрудник
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|ГДЕ
	|	Дополнительные.Регистратор = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Движения.ВКМ_Удержания.Записывать = Истина;

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);

	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

Процедура РассчитатьНДФЛ()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Удержания.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ОсновныеБаза.РезультатБаза, 0) КАК Основные,
	|	ЕСТЬNULL(ДополнительныеБаза.РезультатБаза, 0) КАК Дополнительные
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК Удержания
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
	|		&Измерения, &Измерения, &Разрезы,
	|		Регистратор = &Ссылка И ВидРасчета = &НДФЛ) КАК ОсновныеБаза
	|	ПО Удержания.НомерСтроки = ОсновныеБаза.НомерСтроки
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
	|		&Измерения, &Измерения, &Разрезы,
	|		Регистратор = &Ссылка И ВидРасчета = &НДФЛ) КАК ДополнительныеБаза
	|	ПО Удержания.НомерСтроки = ДополнительныеБаза.НомерСтроки
	|ГДЕ
	|	Удержания.Регистратор = &Ссылка
	|	И Удержания.ВидРасчета = &НДФЛ";

	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");

	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");

	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Движение.Результат = (Выборка.Основные + Выборка.Дополнительные) * 13 / 100;
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать(, Истина);

КонецПроцедуры

Процедура СформироватьВзаиморасчеты()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основные.Сотрудник КАК Сотрудник,
	|	СУММА(Основные.Результат) КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|ГДЕ
	|	Основные.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Основные.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Дополнительные.Сотрудник,
	|	СУММА(Дополнительные.Результат)
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|ГДЕ
	|	Дополнительные.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Дополнительные.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Удержания.Сотрудник,
	|	-СУММА(Удержания.Результат)
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК Удержания
	|ГДЕ
	|	Удержания.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Удержания.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;

	КонецЦикла;

КонецПроцедуры

Процедура СписатьВыполненныеРаботы(Отказ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ОсновныеНачисления;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");

	Попытка
		Блокировка.Заблокировать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось заблокировать данные выполненных работ.",,,,Отказ);
		Возврат;
	КонецПопытки;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основные.Сотрудник КАК Сотрудник,
	|	СУММА(Дополнительные.Результат) КАК СуммаНачисления,
	|	ЕСТЬNULL(Работы.СуммаКОплатеОстаток, 0) КАК СуммаКОплатеОстаток
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК Основные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|		ПО Основные.Сотрудник = Дополнительные.Сотрудник
	|			И Дополнительные.Регистратор = &Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(
	|			&Момент,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					Основные2.Сотрудник
	|				ИЗ
	|					Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК Основные2
	|				ГДЕ
	|					Основные2.Ссылка = &Ссылка)) КАК Работы
	|		ПО Основные.Сотрудник = Работы.Сотрудник
	|ГДЕ
	|	Основные.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Основные.Сотрудник,
	|	Работы.СуммаКОплатеОстаток";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Момент", МоментВремени());

	Выборка = Запрос.Выполнить().Выбрать();

	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

	Пока Выборка.Следующий() Цикл

		Если Выборка.СуммаНачисления <= 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Выборка.СуммаНачисления > Выборка.СуммаКОплатеОстаток Тогда
			ОбщегоНазначения.СообщитьПользователю("Недостаточно суммы выполненных работ для начисления сотруднику.",,,,Отказ);
			Продолжить;
		КонецЕсли;

		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.СуммаКОплате = Выборка.СуммаНачисления;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли