#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаАбонентскоеОбслуживание = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
    ГруппаАбонентскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаАбонентскоеОбслуживание.ОтображатьЗаголовок = ИСТИНА;
    ГруппаАбонентскоеОбслуживание.Заголовок = "Абонентское обслуживание";
   	ГруппаАбонентскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
        
    ГруппаПериод = Элементы.Добавить("ВКМ_ГруппаПериод", Тип("ГруппаФормы"), ГруппаАбонентскоеОбслуживание);
    ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаПериод.ОтображатьЗаголовок = ЛОЖЬ;
    ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
     
    ГруппаСуммы = Элементы.Добавить("ВКМ_ГруппаСуммы", Тип("ГруппаФормы"), ГруппаАбонентскоеОбслуживание);
    ГруппаСуммы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаСуммы.ОтображатьЗаголовок = ЛОЖЬ;
    ГруппаСуммы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
    
    ДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ГруппаПериод);
    ДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
    ДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
     
    ДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ГруппаПериод);
    ДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
    ДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
    
    АбонентскаяПлата = Элементы.Добавить("ВКМ_ЕжемесячнаяАбонентскаяПлата", Тип("ПолеФормы"), ГруппаСуммы);
    АбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода;
    АбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_ЕжемесячнаяАбонентскаяПлата";
     
    СтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаСуммы);
    СтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
    СтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	
	ВКМ_ОбновитьВидимостьАбонентскихРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_ОбновитьВидимостьАбонентскихРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ОбновитьВидимостьАбонентскихРеквизитов()
    Элементы.ВКМ_ГруппаАбонентскоеОбслуживание.Видимость = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
КонецПроцедуры

#КонецОбласти