#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьНакопленныеУведомления() Экспорт

    Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	
	Токен = Константы.ВКМ_ТокенТелеграмБота.Получить();
    ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
    
    Если ПустаяСтрока(Токен) Тогда
        ЗаписьЖурналаРегистрации("ВКМ_Телеграм", УровеньЖурналаРегистрации.Ошибка,,,
            "Не заполнен токен Телеграм-бота.");
        Возврат;
    КонецЕсли;
    
    Если ПустаяСтрока(ИдентификаторГруппы) Тогда
        ЗаписьЖурналаРегистрации("ВКМ_Телеграм", УровеньЖурналаРегистрации.Ошибка,,,
            "Не заполнен идентификатор группы Телеграм.");
        Возврат;
    КонецЕсли;

	
    Пока Выборка.Следующий() Цикл

        УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
        УспешноОтправлено = Ложь;

        УспешноОтправлено = ОтправитьСообщение(УведомлениеОбъект.ВКМ_ТекстСообщения, Токен, ИдентификаторГруппы);

        Если УспешноОтправлено Тогда
            Попытка
                УведомлениеОбъект.Удалить();
            Исключение
                ЗаписьЖурналаРегистрации("ВКМ_Телеграм", УровеньЖурналаРегистрации.Ошибка,,,
				"Не удалось удалить отправленное уведомление: " + ОписаниеОшибки());
            КонецПопытки;
		КонецЕсли;

    КонецЦикла;

КонецПроцедуры

Функция ОтправитьСообщение(ТекстСообщения, Токен, ИдентификаторГруппы) Экспорт

	Попытка 
		
		Соединение =  Новый HTTPСоединение("api.telegram.org",,,,,, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
		
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("chat_id", ИдентификаторГруппы);
		СтруктураСообщения.Вставить("text", ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);
		ТелоЗапроса = ЗаписьJSON.Закрыть();
		
		HTTPЗапрос = Новый HTTPЗапрос("/bot" + Токен + "/sendMessage");
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
		
		Ответ = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
	Исключение
		ЗаписьЖурналаРегистрации("Отправка сообщения в телеграмм. Непредвиденная ошибка.", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());		
		Возврат Ложь;
	КонецПопытки;
	
	Если Ответ.КодСостояния <> 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("ВКМ_Телеграм", УровеньЖурналаРегистрации.Ошибка,,,
		"Ошибка отправки Телеграм. Код: " + Ответ.КодСостояния + ". Ответ: " + ТелоОтвета);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти