#language: ru

@tree

Функционал: Закрытие обслуживаний от имени Специалиста

Как Специалист я хочу
закрывать назначенные мне обслуживания
чтобы фиксировать фактически выполненные работы и количество отработанных часов.   

Контекст:
	Дано я подключаю TestClient "КлиентТестирования" логин "Специалист" пароль ""
    И я закрываю все окна клиентского приложения

Сценарий: Специалист закрывает запланированные обслуживания
И В командном интерфейсе я выбираю "Обслуживание клиентов (ВКМ)" "Обслуживания клиентов"
Тогда открылось окно "Обслуживания клиентов"

Если таблица "Список" содержит строки: Тогда
	| "Договор"                 | "Клиент"      | "Номер"     | "Описание проблемы" | "Специалист" |
	| "Абонентское Контрагент1" | "Контрагент1" | "000000001" | "Проблема 1 - 3"    | "Иванов"     |
	и в таблице "Список" я перехожу к строке:
	| "Договор"                 | "Клиент"      | "Номер"     | "Описание проблемы" | "Специалист" |
	| "Абонентское Контрагент1" | "Контрагент1" | "000000001" | "Проблема 1 - 3"    | "Иванов"     |
И в таблице "Список" я выбираю текущую строку

Тогда открылось окно "Обслуживание клиента * от *"
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И в таблице 'ВКМ_ВыполненныеРаботы' я выбираю текущую строку
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ОписаниеРабот' я ввожу текст "Решена Проблема 1 - 3"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасов'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасов' я ввожу текст "10,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ЧасыКОплатеКлиенту'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ЧасыКОплатеКлиенту' я ввожу текст "7,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
Тогда открылось окно "Обслуживания клиентов"
Если таблица "Список" содержит строки: Тогда
	| "Дата проведения работ" | "Договор"                 | "Клиент"      | "Номер"     | "Описание проблемы" | "Специалист" |
	| "29.09.2026"            | "Абонентский Контрагент2" | "Контрагент2" | "000000002" | "Проблема 1"        | "Иванова"    |
	и в таблице "Список" я перехожу к строке:
	| "Дата проведения работ" | "Договор"                 | "Клиент"      | "Номер"     | "Описание проблемы" | "Специалист" |
	| "29.09.2026"            | "Абонентский Контрагент2" | "Контрагент2" | "000000002" | "Проблема 1"        | "Иванова"    |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *"
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ОписаниеРабот' я ввожу текст "Решена Проблема 1"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасов'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасов' я ввожу текст "2,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ЧасыКОплатеКлиенту'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ЧасыКОплатеКлиенту' я ввожу текст "3,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
Тогда открылось окно "Обслуживания клиентов"
Если таблица "Список" содержит строки: Тогда
	| "Дата проведения работ" | "Договор"                 | "Клиент"      | "Номер"     | "Описание проблемы" | "Специалист" |
	| "29.09.2026"            | "Абоненсткий Контрагент3" | "Контрагент3" | "000000003" | "Проблема 1-3"      | "Петров"     |
	и в таблице "Список" я перехожу к строке:
	| "Дата проведения работ" | "Договор"                 | "Клиент"      | "Номер"     | "Описание проблемы" | "Специалист" |
	| "29.09.2026"            | "Абоненсткий Контрагент3" | "Контрагент3" | "000000003" | "Проблема 1-3"      | "Петров"     |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *"
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ОписаниеРабот' я ввожу текст "Решена Проблема 1 - 3"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасов'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ФактическиПотраченоЧасов' я ввожу текст "4,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ЧасыКОплатеКлиенту'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыВКМ_ЧасыКОплатеКлиенту' я ввожу текст "6,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
И я закрываю все окна клиентского приложения
И я закрываю сеанс текущего клиента тестирования