#language: ru

@tree

Функционал: Массовое создание актов от имени Бухгалтера

Как Бухгалтер я хочу
массово создавать документы реализации 
чтобы быстро сформировать акты клиентам за выполненные работы.   

Контекст:
	Дано я подключаю TestClient "КлиентТестирования" логин "БухгалтерИТФирмы" пароль ""
    И я закрываю все окна клиентского приложения

Сценарий: Бухгалтер массово создает реализации по выполненным обслуживаниям
И В командном интерфейсе я выбираю "Обслуживание клиентов (ВКМ)" "Массовое создание актов"
Тогда открылось окно "Массовое создание актов"
И я нажимаю кнопку выбора у поля с именем 'Период'
Тогда открылось окно 'Выберите период'
И в поле с именем 'DateBegin' я ввожу текст '01.09.2026'
И в поле с именем 'DateEnd' я ввожу текст '30.09.2026'
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно 'Массовое создание актов'
И я нажимаю на кнопку с именем 'Заполнить'
И В командном интерфейсе я выбираю "Покупки и продажи" "Реализации товаров и услуг"
Тогда открылось окно "Реализации товаров и услуг"
И в таблице 'Список' я выделяю все строки
И я нажимаю на кнопку с именем 'ПодменюПечатьОбычное__ВКМ_АктОбОказанныхУслугах'
И я закрываю все окна клиентского приложения
И я закрываю сеанс текущего клиента тестирования