#language: ru

@tree

Функционал: Планирование нескольких обслуживаний на специалистов от имени Менеджера

Как Менеджер я хочу
планировать несколько обслуживаний клиентов 
чтобы распределять работы между специалистами и формировать план обслуживаний.  

Контекст:
	Дано я подключаю TestClient "КлиентТестирования" логин "Менеджер" пароль ""
    И я закрываю все окна клиентского приложения

Сценарий: Планирование нескольких обслуживаний на специалистов от имени Менеджера
И В командном интерфейсе я выбираю "Обслуживание клиентов (ВКМ)" "Обслуживания клиентов"
Тогда открылось окно "Обслуживания клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Клиент'
Тогда открылось окно "Контрагенты"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Договор'
Тогда открылось окно "Договоры контрагентов"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование"            |
	| "000000001" | "Абонентское Контрагент1" |
	и в таблице "Список" я перехожу к строке:
	| "Код"       | "Наименование"            |
	| "000000001" | "Абонентское Контрагент1" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Специалист'
Тогда открылось окно "Сотрудники"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование" |
	| "000000001" | "Иванов"       |
	и в таблице "Список" я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000001" | "Иванов"       |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И в поле с именем 'ВКМ_ОписаниеПроблемы' я ввожу текст "Проблема 1 - 3"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_ДатаПроведенияРабот'
И в поле с именем 'ВКМ_ДатаПроведенияРабот' я ввожу текст "29.09.2026"
И в поле с именем 'ВКМ_ВремяНачалаРабот' я ввожу текст "10:00:00"
И я перехожу к следующему реквизиту
И в поле с именем 'ВКМ_ВремяОкончанияРабот' я ввожу текст "17:00:00"
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно "Обслуживание клиента * от *"
И Я закрываю окно "Обслуживание клиента * от *"
Тогда открылось окно "Обслуживания клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Клиент'
Тогда открылось окно "Контрагенты"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование" |
	| "000000002" | "Контрагент2"  |
	и в таблице "Список" я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000002" | "Контрагент2"  |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Договор'
Тогда открылось окно "Договоры контрагентов"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование"            |
	| "000000004" | "Абонентский Контрагент2" |
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"            |
	| "000000004" | "Абонентский Контрагент2" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Специалист'
Тогда открылось окно "Сотрудники"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование" |
	| "000000006" | "Иванова"      |
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000006" | "Иванова"      |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И в поле с именем 'ВКМ_ОписаниеПроблемы' я ввожу текст "Проблема 1"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_ДатаПроведенияРабот'
И в поле с именем 'ВКМ_ДатаПроведенияРабот' я ввожу текст "29.09.2026"
И в поле с именем 'ВКМ_ВремяНачалаРабот' я ввожу текст "11:00:00"
И в поле с именем 'ВКМ_ВремяОкончанияРабот' я ввожу текст "13:00:00"
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно "Обслуживание клиента * от *"
И Я закрываю окно "Обслуживание клиента * от *"
Тогда открылось окно "Обслуживания клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Клиент'
Тогда открылось окно "Контрагенты"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование" |
	| "000000003" | "Контрагент3"  |
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000003" | "Контрагент3"  |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Договор'
Тогда открылось окно "Договоры контрагентов"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование"            |
	| "000000005" | "Абоненсткий Контрагент3" |
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"            |
	| "000000005" | "Абоненсткий Контрагент3" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Специалист'
Тогда открылось окно "Сотрудники"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование" |
	| "000000002" | "Петров"       |
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000002" | "Петров"       |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И в поле с именем 'ВКМ_ОписаниеПроблемы' я ввожу текст "Проблема 1-3"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_ДатаПроведенияРабот'
И в поле с именем 'ВКМ_ДатаПроведенияРабот' я ввожу текст "29.09.2026"
И в поле с именем 'ВКМ_ВремяНачалаРабот' я ввожу текст "12:00:00"
И в поле с именем 'ВКМ_ВремяОкончанияРабот' я ввожу текст "18:00:00"
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно "Обслуживание клиента * от *"
И Я закрываю окно "Обслуживание клиента * от *"
И я закрываю все окна клиентского приложения
И я закрываю сеанс текущего клиента тестирования


