#language: ru

@tree

Функционал: Формирование отчёта Анализ выставленных актов, сравнение с эталоном

Как Бухгалтер я хочу
сформировать отчет "Анализ выставленных актов" 
чтобы сравнить выставлены и фактически суммы за выполненные работы.   

Контекст:
	Дано я подключаю TestClient "КлиентТестирования" логин "БухгалтерИТФирмы" пароль ""
    И я закрываю все окна клиентского приложения

Сценарий: Формирование отчета Анализ выставленных актов и сравнение с эталоном
И В командном интерфейсе я выбираю "Обслуживание клиентов (ВКМ)" "Анализ выставленных актов"
Тогда открылось окно "Анализ выставленных актов"
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
Тогда открылось окно "Выберите период"
И в поле с именем 'DateBegin' я ввожу текст "01.09.2026"
И я перехожу к следующему реквизиту
И в поле с именем 'DateEnd' я ввожу текст "30.09.2026"
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно "Анализ выставленных актов"
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение'
Тогда открылось окно "Номенклатура"
Если таблица "Список" содержит строки: Тогда
	| "Код"       | "Наименование"       |
	| "000000002" | "Работа специалиста" |
	и в таблице "Список" я перехожу к строке:
	| "Код"       | "Наименование"       |
	| "000000002" | "Работа специалиста" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Анализ выставленных актов"
И я нажимаю на кнопку с именем 'СформироватьОтчет'
И Табличный документ "ОтчетТабличныйДокумент" равен макету "АнализВыставленныхАктов.mxl"
И я закрываю все окна клиентского приложения
И я закрываю сеанс текущего клиента тестирования