#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
    
    ДлительнаяОперация = НачатьСозданиеРеализацийНаСервере();
    
    Если ДлительнаяОперация = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗавершениеСозданияРеализаций", ЭтотОбъект);
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.Интервал = 1;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьСозданиеРеализацийНаСервере()
    
    Если Не ЗначениеЗаполнено(Объект.Период) Тогда
        ОбщегоНазначения.СообщитьПользователю("Не заполнен период.");
        Возврат Неопределено;
    КонецЕсли;
    
     ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
        УникальныйИдентификатор,
        "Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_СоздатьРеализацииПоАбонентскимДоговорам",
        Объект.Период.ДатаНачала,
        Объект.Период.ДатаОкончания);
    
    Возврат ДлительнаяОперация;
    
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеСозданияРеализаций(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если Результат.Статус = "Ошибка" Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю(
            "Ошибка при создании реализаций: " + Результат.КраткоеПредставлениеОшибки);
        Возврат;
    КонецЕсли;
    
    Если Результат.Статус = "Выполнено" Тогда
        
        Если ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
            ДанныеРезультата = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
         	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
        	ЗаполнитьТаблицуРезультатов(ДанныеРезультата);
        Иначе
        	ОбщегоНазначенияКлиент.СообщитьПользователю("Невозможно получить данные. Адрес хранилища не заполнен.");
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуРезультатов(ДанныеРезультата)
    
    Объект.Договоры.Очистить();
    
    Если ДанныеРезультата = Неопределено Или ДанныеРезультата.Количество() = 0 Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("По заданному периоду не найдено подходящих договоров.");
        Возврат;
    КонецЕсли;
    
    Для Каждого СтрокаДанных Из ДанныеРезультата Цикл
        НоваяСтрока = Объект.Договоры.Добавить();
        НоваяСтрока.Договор = СтрокаДанных.Договор;
        НоваяСтрока.ДокРеализация = СтрокаДанных.Реализация;
    КонецЦикла;
    
    Элементы.Договоры.Обновить();
    
КонецПроцедуры

&НаСервере
Функция СформироватьАктыНаСервере(МассивРеализаций)
    
    ТабличныйДокумент = ВКМ_ОбщийМодульВызовСервера.ВКМ_ПечатьАктаОбОказанныхУслугах(МассивРеализаций);
    Возврат ТабличныйДокумент;
    
КонецФункции

#КонецОбласти